# IFCProperty Mapping Info IFCProperty Name Property

Source: https://www.revitapidocs.com/2026/92880b4e-a41e-23e2-4d40-2ed1d6aa4a28.htm

---

| IFCProperty Mapping Info IFCProperty Name Property |
| --- |

The IFC property name.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public string IFCPropertyName { get; set; }
```

```
Public Property IFCPropertyName As String
	Get
	Set
```

```
public:
property String^ IFCPropertyName {
	String^ get ();
	void set (String^ value);
}
```

```
member IFCPropertyName : string with get, set
```

#### Property Value

String Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

IFCPropertyMappingInfo Class Autodesk.Revit.DB Namespace